{
  "suspects": [
    {
      "id": "sari-station-master",
      "name": "Sari Indraswari",
      "age": 45,
      "occupation": "Station Master",
      "backstory": "Veteran railway employee with 20 years of service at Stasiun Manggarai. Known for her strict adherence to schedules and procedures. Recently under pressure due to increasing delays and passenger complaints.",
      "alibi": "Was in the control room monitoring train departures from 7:00-8:30 PM, with CCTV footage showing her presence.",
      "motive": "The victim (Pak Budi, Head of Operations) was planning to restructure the station management, potentially demoting Sari from her position.",
      "appearance": "Middle-aged woman with graying hair always in a neat bun, wearing the official station master uniform with badge number 7742.",
      "personality": "Authoritative, detail-oriented, but recently showing signs of stress. Values tradition and established procedures.",
      "relationshipToVictim": "Direct subordinate who disagreed with victim's modernization plans",
      "suspicionLevel": 7,
      "imageUrl": "/images/suspects/sari-station-master.jpg",
      "isGuilty": false
    },
    {
      "id": "rahman-security",
      "name": "Rahman Pratama",
      "age": 38,
      "occupation": "Security Chief",
      "backstory": "Former police officer who joined railway security 5 years ago. Responsible for station safety and crowd control during peak hours. Has access to all security footage and station areas.",
      "alibi": "Claims he was patrolling the platform areas from 7:15-8:45 PM, but no witnesses can confirm his exact location during the incident.",
      "motive": "Discovered the victim was embezzling funds meant for security improvements, threatening to expose him before Rahman could gather evidence.",
      "appearance": "Tall, athletic build with a military bearing. Always carries a radio and security keys. Distinctive scar on left hand from his police days.",
      "personality": "Observant, protective, methodical in his approach to problems. Shows strong moral convictions about justice.",
      "relationshipToVictim": "Professional relationship that became tense after discovering financial irregularities",
      "suspicionLevel": 8,
      "imageUrl": "/images/suspects/rahman-security.png",
      "isGuilty": true
    },
    {
      "id": "maya-ticket-clerk",
      "name": "Maya Kusuma",
      "age": 26,
      "occupation": "Senior Ticket Clerk",
      "backstory": "Recent university graduate in business administration, working at the station for 3 years. Ambitious and tech-savvy, often proposing digital improvements to ticketing systems.",
      "alibi": "Was serving customers at ticket counter until 7:45 PM, then went to staff break room. Several passengers remember her distinctive cheerful service.",
      "motive": "The victim rejected her proposal for digital ticketing modernization, which would have earned her a promotion and recognition.",
      "appearance": "Young woman with shoulder-length black hair, usually wearing the standard blue ticket clerk uniform. Known for her bright smile and efficient service.",
      "personality": "Enthusiastic, ambitious, sometimes impatient with older colleagues' resistance to change. Generally well-liked by passengers.",
      "relationshipToVictim": "Professional relationship with some tension over modernization disagreements",
      "suspicionLevel": 4,
      "imageUrl": "/images/suspects/maya-ticket-clerk.png",
      "isGuilty": false
    },
    {
      "id": "agus-maintenance",
      "name": "Agus Santoso",
      "age": 52,
      "occupation": "Chief Maintenance Engineer",
      "backstory": "Long-serving employee with deep knowledge of the station's infrastructure. Recently diagnosed with early-stage diabetes, requiring expensive treatment. Known for his technical expertise and problem-solving abilities.",
      "alibi": "Was in the equipment room checking electrical systems from 7:30-8:00 PM, alone, but maintenance logs show his keycard access.",
      "motive": "Desperately needed money for medical treatment. The victim discovered Agus was selling station equipment to private buyers.",
      "appearance": "Stocky build with calloused hands from years of manual work. Often carries a toolbox and wears oil-stained work clothes. Walks with a slight limp from an old injury.",
      "personality": "Practical, hardworking, and usually quiet. Recently more withdrawn due to health concerns and financial stress.",
      "relationshipToVictim": "Long professional relationship that became strained when the victim discovered the equipment theft",
      "suspicionLevel": 6,
      "imageUrl": "/images/suspects/agus-santoso.png",
      "isGuilty": false
    },
    {
      "id": "indira-cleaner",
      "name": "Indira Wulandari",
      "age": 34,
      "occupation": "Head of Cleaning Services",
      "backstory": "Single mother of two children, working multiple jobs to support her family. Has been with the station for 8 years, gradually working her way up to supervise the cleaning staff. Very observant due to her work covering all station areas.",
      "alibi": "Was cleaning the upper level offices from 7:00-8:30 PM with two junior staff members who can confirm her presence.",
      "motive": "The victim was planning to outsource cleaning services to cut costs, which would have resulted in Indira losing her job and benefits.",
      "appearance": "Medium height with strong build from physical work. Always carries cleaning supplies and wears the green cleaning staff uniform. Known for her efficiency and attention to detail.",
      "personality": "Hardworking, observant, fiercely protective of her employees and family. Generally positive but stressed about job security.",
      "relationshipToVictim": "Professional relationship with growing tension over outsourcing plans",
      "suspicionLevel": 5,
      "imageUrl": "/images/suspects/indira-cleaner.png",
      "isGuilty": false
    },
    {
      "id": "bayu-announcer",
      "name": "Bayu Nugroho",
      "age": 31,
      "occupation": "Public Announcer & Information Officer",
      "backstory": "Communications graduate who handles all station announcements and passenger information. Known for his clear voice and calm demeanor during emergencies. Recently engaged and planning an expensive wedding.",
      "alibi": "Was in the announcement booth making scheduled arrival/departure announcements from 7:20-8:15 PM, recorded on station audio logs.",
      "motive": "The victim discovered Bayu was accepting bribes from vendors to make unofficial announcements, threatening his job and future marriage.",
      "appearance": "Well-groomed appearance with a professional demeanor. Always wears a headset and carries official station communication devices. Known for his distinctive calm voice.",
      "personality": "Articulate, composed under pressure, but secretly struggling with financial pressures from wedding planning.",
      "relationshipToVictim": "Professional relationship that became problematic when corruption was discovered",
      "suspicionLevel": 6,
      "imageUrl": "/images/suspects/bayu-announcer.png",
      "isGuilty": false
    },
    {
      "id": "fitri-canteen",
      "name": "Fitri Maharani",
      "age": 41,
      "occupation": "Canteen Manager",
      "backstory": "Experienced food service manager who runs the station canteen and coordinates with food vendors. Known for her excellent cooking and business acumen. Recently expanded her operation but struggling with increased competition.",
      "alibi": "Was in the canteen kitchen preparing for the evening shift from 7:00-8:45 PM, with several vendors and customers present.",
      "motive": "The victim was planning to bring in a large chain restaurant to replace the current canteen, threatening Fitri's livelihood and that of her employees.",
      "appearance": "Energetic woman with an apron often stained from cooking. Always carries order notebooks and has easy access to kitchen knives and utensils. Known for her warm smile and business-focused approach.",
      "personality": "Entrepreneurial, friendly to customers, but fiercely competitive when it comes to her business. Protective of her employees and regular customers.",
      "relationshipToVictim": "Business relationship that became adversarial over canteen replacement plans",
      "suspicionLevel": 5,
      "imageUrl": "/images/suspects/fitri-canteen.png",
      "isGuilty": false
    }
  ],
  "victim": {
    "id": "budi-operations",
    "name": "Pak Budi Hermawan",
    "age": 48,
    "occupation": "Head of Operations",
    "backstory": "Senior management official responsible for overall station operations and efficiency improvements. Recently appointed to modernize Stasiun Manggarai operations, making him both respected and resented by different staff members.",
    "lastSeen": "7:50 PM in the administrative offices on the upper level",
    "timeOfDeath": "approximately 8:15 PM",
    "causeOfDeath": "Blunt force trauma to the head with a heavy object",
    "locationFound": "Storage room near the maintenance area, discovered at 8:45 PM"
  }
} 